# -*- coding: utf-8 -*-
"""
用于本地开发环境的全局配置
"""
from settings import APP_ID


# ===============================================================================
# 数据库设置, 本地开发数据库设置
# ===============================================================================

DATABASES = {
    'default': {
        'ENGINE': 'django.db.backends.mysql',
        # 'NAME':APP_ID,   # 要连接的数据库，连接前需要创建好
        'NAME':'db_mfw',   # 要连接的数据库，连接前需要创建好
        # 'NAME':'mfw',   # 要连接的数据库，连接前需要创建好
        'USER':'sudada',   # 连接数据库的用户名
        'PASSWORD':'123456',   # 连接数据库的密码
        'HOST':'192.168.33.10',    # 连接主机，默认本级
        'PORT':3306            # 端口 默认3306
    }
}
